app/views/evaluation_sessions/_activities_neterminal.html.erb

      <td>
        <%= Course.find_by_id(key[0]).title %>
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

      <td>
        <% teacher = Teacher.find_by_id(key[1]) %>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 14]]