app/views/evaluation_sessions/_form_session.html.erb

                <div class="col-lg-8">
                  <%= f.select :form2, Form.all.collect { |p| [p.title, p.id] }, {selected: @evaluation_session.form_id, include_blank: true}, class: 'form-control  col-xs-8' %>
---
SELECT "forms".* FROM "forms"