app/views/cohorts/_form.html.erb

SELECT "departments".* FROM "departments"
---
          <div class="col-lg-7">
            <%= f.select :department_id, Department.all.collect { |p| [p.name, p.id] }, {selected: @cohort.department_id, include_blank: true}, class: 'form-control  col-xs-9' %>