app/views/evaluation/_index.html.erb

                <td class="col-md-8">
                  <%= activity.teacher.last_name %> <%= activity.teacher.first_name %>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 14]]