app/views/evaluation/eval_form.html.erb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 14]]
---
      <h1><b>  <%= @activity.course.title %></b> </h1>
      <h2><%= @activity.teacher.last_name %> <%= @activity.teacher.first_name %></h2>