app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."semester" = $1  ORDER BY "activities"."course_id" ASC  [["semester", 1]]
---
  def update
    @activity.update(activity_params)
    @activities1 = Activity.where(:semester => 1).order(:course_id)

INSERT INTO "activities" ("course_id", "is_optional", "teacher_id", "semester", "year", "cohort_id", "activity_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "activities".* FROM "activities" WHERE "activities"."semester" = $1  ORDER BY "activities"."course_id" ASC  [["semester", 1]]
---
  def create
    activity_params['cohorts'].each do |cohort_id|
      if (!cohort_id.empty?)
        activity_params['activities'].each do |type|
          if (!type.empty?)
            @activity = Activity.new(activity_params)
            @activity.year = if Date.today.month > 8 then
                               Date.today.year
                             else
                               Date.today.year - 1
                             end
            @activity.cohort_id = cohort_id
            @activity.activity_type = type
            @activity.save
          end
        end

      end
    end
    @activities1 = Activity.where(:semester => 1).order(:course_id)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT 1  [["id", 6]]
---
  def delete
    @activity = Activity.find(params[:activity_id])

DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 6]]
SELECT "activities".* FROM "activities" WHERE "activities"."semester" = $1  ORDER BY "activities"."course_id" ASC  [["semester", 1]]
---
  def destroy
    @activity.destroy
    @activities1 = Activity.where(:semester => 1).order(:course_id)

SELECT "activities".* FROM "activities" WHERE "activities"."semester" IS NULL AND "activities"."activity_type" IN ('Laborator', 'Seminar', 'Proiect')
DELETE FROM "activities" WHERE "activities"."semester" = $1 AND "activities"."activity_type" IN ('Laborator', 'Seminar', 'Proiect')  [["semester", 1]]
SELECT "activities".* FROM "activities" WHERE "activities"."semester" = $1  ORDER BY "activities"."course_id" ASC  [["semester", 1]]
---
  def delete_all_activities_for_exam
    sem = params[:sem]
    activities = Activity.where(:semester => sem, :activity_type => ['Laborator','Seminar','Proiect'])
    activities.delete_all
    @activities1 = Activity.where(:semester => 1).order(:course_id)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT 1  [["id", 6]]
---
  def set_activity
    @activity = Activity.find(params[:id])