app/controllers/cohorts_controller.rb

  def create
    @cohort = Cohort.new(cohort_params)
    @cohort.save
    @cohorts = Cohort.all
    @departments_select = Department.all
---
INSERT INTO "cohorts" ("name", "is_terminal", "students_number", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "123"], ["is_terminal", "f"], ["students_number", 21], ["department_id", 1], ["created_at", "2017-12-13 07:31:39.519725"], ["updated_at", "2017-12-13 07:31:39.519725"]]
SELECT "cohorts".* FROM "cohorts"
SELECT "departments".* FROM "departments"

  def import
    @errors =[]
    if request.post?
      CSV.parse params[:csv] do |row|
        dep = Department.find_by_name(row[4].to_s.squish)
        terminal = row[1].to_s.squish.downcase == 'da' ? true : false
        if !dep.nil?
          Cohort.create(name: row[0].to_s.squish, is_terminal: terminal, students_number: row[2], optionals_number: row[3], department_id: dep.id)
        end

      end
      @cohorts = Cohort.all
      @departments_select = Department.all
---
SELECT  "departments".* FROM "departments" WHERE "departments"."name" = $1 LIMIT 1  [["name", "Nume Departament"]]
INSERT INTO "cohorts" ("name", "is_terminal", "students_number", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "211"], ["is_terminal", "f"], ["students_number", 23], ["department_id", 1], ["created_at", "2018-02-19 13:28:08.782406"], ["updated_at", "2018-02-19 13:28:08.782406"]]
SELECT "cohorts".* FROM "cohorts"
SELECT "departments".* FROM "departments"

  def download

    cohorts = []

    Cohort.pluck(:name, :is_terminal, :students_number, :optionals_number, :department_id).each do |cohort|
---
SELECT "cohorts"."name", "cohorts"."is_terminal", "cohorts"."students_number", "cohorts"."optionals_number", "cohorts"."department_id" FROM "cohorts"