app/controllers/control_panel_controller.rb

SELECT "departments".* FROM "departments"
SELECT "cohorts".* FROM "cohorts"
SELECT "teachers".* FROM "teachers"  ORDER BY "teachers"."last_name" ASC
SELECT "courses".* FROM "courses"  ORDER BY "courses"."title" ASC
SELECT "activities".* FROM "activities" WHERE "activities"."semester" = $1  ORDER BY "activities"."course_id" ASC  [["semester", 1]]
SELECT "evaluation_sessions".* FROM "evaluation_sessions"
SELECT "eval_session_activities".* FROM "eval_session_activities"  ORDER BY "eval_session_activities"."course_id" ASC
---
  def index
    #@courses_semI = getCoursesForSemester(1)
    #@courses_semII = getCoursesForSemester(2);
    @current_tab = 'setari'
    @departments_select = Department.all
    @selected_department = 0
    @tab = params['tab']
    if @tab.nil?
      @tab = 'activities'
    end
    if @tab == 'cohorts'
      @cohorts = Cohort.all
    elsif @tab == 'teachers'
      @teachers = Teacher.order(:last_name)
    elsif @tab == 'departments'
      @departments = Department.all
    elsif @tab == 'courses'
      @courses = Course.order(:title)
    elsif @tab == 'activities'
      @activities1 = Activity.where(:semester => 1).order(:course_id)
      @activities2 = Activity.where(:semester => 2).order(:course_id)
    elsif @tab == 'current'
      @active_session = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == true }.first
      @active_session_neterminal = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == false }.first

      @activities_terminal = EvalSessionActivity.order(:course_id).select { |activity| activity.evaluation_session == @active_session }