app/controllers/courses_controller.rb

UPDATE "courses" SET "department_id" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["department_id", 2], ["updated_at", "2018-02-19 13:25:52.219173"], ["id", 4]]
---
  def update
    @course.update(course_params)

INSERT INTO "courses" ("title", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "algebra"], ["department_id", 1], ["created_at", "2017-12-13 07:32:08.863807"], ["updated_at", "2017-12-13 07:32:08.863807"]]
---
  def create
    @course = Course.new(course_params)
    @course.save

SELECT "courses"."title", "courses"."department_id" FROM "courses"
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT 1  [["id", 1]]
---
  def download
    courses = []

    Course.pluck(:title,  :department_id).each do |course|
      course << Department.find_by_id(course[1]).name