app/controllers/departments_controller.rb

  def create
    @department = Department.new(department_params)
    @department.save
    @departments = Department.all
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "mate"], ["created_at", "2017-12-13 07:30:26.875390"], ["updated_at", "2017-12-13 07:30:26.875390"]]
SELECT "departments".* FROM "departments"

  def update
    @department.update(department_params)
    @departments = Department.all
---
UPDATE "departments" SET "name" = $1, "updated_at" = $2 WHERE "departments"."id" = $3  [["name", "Matematica"], ["updated_at", "2017-12-13 07:31:11.740922"], ["id", 1]]
SELECT "departments".* FROM "departments"

  def set_department
    @department = Department.find(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT 1  [["id", 1]]