app/controllers/evaluation_controller.rb

  def eval_form
    @activity = EvalSessionActivity.find(params[:activity_id])

    @completed_activity = CompletedEvaluation.find_by_incognito_token_and_eval_session_activity_id(@current_user_token.token, @activity.id)
---
SELECT  "eval_session_activities".* FROM "eval_session_activities" WHERE "eval_session_activities"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "completed_evaluations".* FROM "completed_evaluations" WHERE "completed_evaluations"."incognito_token" = $1 AND "completed_evaluations"."eval_session_activity_id" = $2 LIMIT 1  [["incognito_token", "FTgPjnjVQ9gye+zs"], ["eval_session_activity_id", 1]]

  def evaluate_activity
    @activity = EvalSessionActivity.find(params[:activity_id])

    @completed_activity = CompletedEvaluation.find_by_incognito_token_and_eval_session_activity_id(@current_user_token.token, @activity.id)
---
SELECT  "eval_session_activities".* FROM "eval_session_activities" WHERE "eval_session_activities"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "completed_evaluations".* FROM "completed_evaluations" WHERE "completed_evaluations"."incognito_token" = $1 AND "completed_evaluations"."eval_session_activity_id" = $2 LIMIT 1  [["incognito_token", "FTgPjnjVQ9gye+zs"], ["eval_session_activity_id", 1]]

        if @not_completed == true
          flash[:error] = 'Nu ai completat toate intrebarile '
        else
          CompletedEvaluation.create(incognito_token: @current_user_token.token,
                                     eval_session_activity: @activity,
                                     content: answers.to_json,
                                     date: DateTime.now,
                                     time: now)
---
INSERT INTO "completed_evaluations" ("incognito_token", "eval_session_activity_id", "content", "date", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"