app/controllers/evaluation_sessions_controller.rb

SELECT  "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."status" = $1 AND "evaluation_sessions"."terminal" = 't'  ORDER BY "evaluation_sessions"."id" DESC LIMIT 1  [["status", "Finalizata"]]
SELECT "eval_session_activities".* FROM "eval_session_activities"  ORDER BY "eval_session_activities"."course_id" ASC
---
  def current_session
    @current_tab = 'sesiune activa'

    @active_session = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == true }.first
    @active_session_neterminal = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == false }.first

    @activities_terminal = EvalSessionActivity.order(:course_id).select { |activity| activity.evaluation_session == @active_session }.group_by { |s| [s.course_id, s.teacher_id, s.activity_type] }

SELECT "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."terminal" = 't'
---
  def index
    @current_tab = 'arhiva sesiuni'
    @evaluation_sessions = getAllEvaluationSessions(true)
    @evaluation_sessions_neterminal = getAllEvaluationSessions(false)
    @active_session = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == true }.first

INSERT INTO "evaluation_sessions" ("year", "semester", "status", "form_id", "formS_id", "formL_id", "formP_id", "start_date", "end_date", "terminal", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create

    validate_request(0)

    if @evaluation_session.errors.any?

    else
      ActiveRecord::Base.transaction do
        if @chestionar
          @form = Form.create content: @chestionar, title: @chestionar_title
          @evaluation_session.form_id = @form.id
        end
        if @chestionar_L
          form = Form.create content: @chestionar_L, title: @chestionar_L_title
          @evaluation_session.formL_id = form.id
        end
        if @chestionar_S
          form = Form.create content: @chestionar_S, title: @chestionar_S_title
          @evaluation_session.formS_id = form.id
        end
        if @chestionar_P

          form = Form.create content: @chestionar_P, title: @chestionar_P_title
          @evaluation_session.formP_id = form.id
        end
        @evaluation_session.save

SELECT "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."terminal" = 't'
---
    end
    @evaluation_sessions = getAllEvaluationSessions(true)
    @evaluation_sessions_neterminal = getAllEvaluationSessions(false)
    @active_session = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == true }.first

SELECT  "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "evaluation_sessions" SET "status" = $1, "updated_at" = $2 WHERE "evaluation_sessions"."id" = $3  [["status", "Activa"], ["updated_at", "2017-12-13 07:33:08.366938"], ["id", 1]]
SELECT "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."terminal" = 't'
---
  def activate

    @evaluation_session = EvaluationSession.find(params[:evaluation_session_id])
    if request.post?
      @evaluation_session.status = 'Activa'
      @evaluation_session.save
      add_evaluation_session_activities(@evaluation_session)
      @evaluation_sessions = getAllEvaluationSessions(true)
      @evaluation_sessions_neterminal = getAllEvaluationSessions(false)
      @active_session = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == true }.first

SELECT  "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "evaluation_sessions" SET "status" = $1, "updated_at" = $2 WHERE "evaluation_sessions"."id" = $3  [["status", "Finalizata"], ["updated_at", "2017-12-13 13:21:47.521360"], ["id", 1]]
SELECT "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."terminal" = 't'
---
  def finalize

    @evaluation_session = EvaluationSession.find(params[:evaluation_session_id])
    if request.post?
      @evaluation_session.status = 'Finalizata'
      @evaluation_session.save
      @evaluation_sessions = getAllEvaluationSessions(true)
      @evaluation_sessions_neterminal = getAllEvaluationSessions(false)
      @active_session = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == true }.first

SELECT "evaluation_sessions".* FROM "evaluation_sessions"
SELECT "eval_session_activities".* FROM "eval_session_activities"  ORDER BY "eval_session_activities"."course_id" ASC
---
  def generate

    if request.post?
      @active_session = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == true }.first
      @active_session_neterminal = EvaluationSession.all.select { |session| session.session_status == 'Activa' and session.terminal == false }.first

      @activities_terminal = EvalSessionActivity.order(:course_id).select { |activity| activity.evaluation_session == @active_session }.group_by { |s| [s.course_id, s.teacher_id, s.activity_type] }

SELECT  "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def get_tokens
    session = EvaluationSession.find_by_id params[:evaluation_session_id]

SELECT  "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "evaluation_sessions" SET "last_refresh" = $1, "updated_at" = $2 WHERE "evaluation_sessions"."id" = $3  [["last_refresh", "2017-12-13 07:33:17.935763"], ["updated_at", "2017-12-13 07:33:17.937514"], ["id", 1]]
---
  def set_visibility
    evaluation_session = EvaluationSession.find(params[:evaluation_id])
    evaluation_session.visibility = !evaluation_session.visibility
    evaluation_session.save