app/controllers/forms_controller.rb

SELECT "forms".* FROM "forms"  ORDER BY "forms"."id" ASC
---
  def index
    @forms = Form.all.order(:id)

INSERT INTO "forms" ("content", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "forms".* FROM "forms"  ORDER BY "forms"."id" ASC
---
  def create

    validate_request

    if @form.errors.any?
    else
      @form.save
    end
    @forms = Form.all.order(:id)