app/controllers/home_controller.rb

  def create
    @errors = {}
    get_active_evaluation_session
    if params[:token].blank?
      @errors[:error] = 'Nu te poti loga cu un camp gol!'
      print 'Nu te poti loga cu un camp gol!'
      render 'index' and return
    end
    i_user = IncognitoUser.find_by_token params[:token].strip
    if i_user
#check if there is any active evaluation session

      if @active_session.nil? and @active_session_neterminal.nil?
        @errors[:error] = 'Momentan nu puteti evalua nici un curs'
        print 'Momentan nu puteti evalua nici un curs'
        render 'index' and return
      end

      if i_user.evaluation_session.status != 'Activa'
        @errors[:error] = 'Token invalid'
        print 'Token invalid'
        render 'index' and return
      end

      session[:user_token] = {token: i_user.token, cohort: i_user.evaluation_session_cohort, eval_session: i_user.evaluation_session}

      user_session = ActiveIncognitoUser.find_by_incognito_user_token(i_user.token)
---
SELECT  "incognito_users".* FROM "incognito_users" WHERE "incognito_users"."token" = $1 LIMIT 1  [["token", "FTgPjnjVQ9gye+zs"]]
SELECT  "active_incognito_users".* FROM "active_incognito_users" WHERE "active_incognito_users"."incognito_user_token" = $1 LIMIT 1  [["incognito_user_token", "FTgPjnjVQ9gye+zs"]]

          redirect_to evaluate_path
        end
      else
        ActiveIncognitoUser.create(incognito_user_token: i_user.token, start_date: Time.now)
---
INSERT INTO "active_incognito_users" ("incognito_user_token", "start_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["incognito_user_token", "FTgPjnjVQ9gye+zs"], ["start_date", "2017-12-13 07:33:31.184665"], ["created_at", "2017-12-13 07:33:31.191068"], ["updated_at", "2017-12-13 07:33:31.191068"]]