app/controllers/statistics_controller.rb

  def index
    @current_tab = 'statistici'
    @all_sessions = EvaluationSession.where(status: "Finalizata")
    @courses = Course.all
    @teachers = Teacher.order(:last_name)
---
SELECT  "evaluation_sessions".* FROM "evaluation_sessions" WHERE "evaluation_sessions"."status" = $1 LIMIT 1  [["status", "Finalizata"]]
SELECT "courses".* FROM "courses"
SELECT "teachers".* FROM "teachers"  ORDER BY "teachers"."last_name" ASC

  def download_all()

    #ids=[16,17,20,21,26,27,30,31]
    #ids = [36,38,39,42,35,37,40,41]

    #   ids = [43,44,45,46,47,48,49,50]
    ids = [54, 57, 59, 55, 56, 58]
    # ids = EvaluationSession.all.pluck(:id)
    sql = "SELECT evaluation_sessions.id as id, evaluation_sessions.semester as semestru ,
             concat( concat( teachers.last_name, ' ') ,  teachers.first_name) as nume, courses.title as materie,
             eval_session_activities.activity_type as tip, completed_evaluations.content as continut
            FROM
              public.courses,
              public.teachers,
              public.eval_session_activities,
              public.evaluation_sessions,
              public.completed_evaluations
            WHERE
              eval_session_activities.course_id = courses.id AND
              eval_session_activities.teacher_id = teachers.id AND
              eval_session_activities.evaluation_session_id = evaluation_sessions.id AND
              eval_session_activities.id = completed_evaluations.eval_session_activity_id and
              (evaluation_sessions.id in (#{ids.join(', ')}))
            Order by evaluation_sessions.id, evaluation_sessions.semester , teachers.last_name, teachers.first_name,courses.title, eval_session_activities.activity_type ;"
---
SELECT "evaluation_sessions"."id" FROM "evaluation_sessions"
SELECT "teachers".* FROM "teachers"