app/controllers/teachers_controller.rb

  def download
    teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

  def import_from_app
    @errors =[]

    str = "#{API_URL}teachers?oauth_token=#{@current_user.token}"
    info = JSON.parse RestClient.get str, {:accept => :json}

    if not info['error'].nil?
      redirect_to logout_path
      return
    end

    print info['data'].inspect

    info['data'].each do |ch|
      department_name = ch['department'] == 'TCI' ? 'CTI' : ch['department']

      department = Department.find_by_name department_name

      teacher = Teacher.find_by_first_name_and_last_name ch['first_name'], ch['last_name']
      if teacher.nil?
        teacher = Teacher.new
      end

      teacher.first_name = ch['first_name']
      teacher.last_name = ch['last_name']
      teacher.email = ch['email']
      teacher.department = department

      teacher.save
---
SELECT  "departments".* FROM "departments" WHERE "departments"."name" = $1 LIMIT 1  [["name", "Informatica"]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."first_name" = $1 AND "teachers"."last_name" = $2 LIMIT 1  [["first_name", "John55"], ["last_name", "Doe55"]]
SELECT "teachers".* FROM "teachers"  ORDER BY "teachers"."last_name" ASC
INSERT INTO "teachers" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "John55"], ["last_name", "Doe55"], ["email", "d9919@example.com"], ["created_at", "2017-12-13 07:29:59.788412"], ["updated_at", "2017-12-13 07:29:59.788412"]]