app/controllers/user_sessions_controller.rb

  def create

    cookies[:selection] = nil
    omniauth = env['omniauth.auth']
    logger.debug "+++ #{omniauth}"

    user = User.find_by uid: omniauth['uid']
    if not user
      # New user registration
      user = User.new(:uid => omniauth['uid'])
    end
    user.first_name = omniauth['extra']['first_name']
    user.last_name = omniauth['extra']['last_name']
    user.email = omniauth['extra']['email']
    user.is_student = omniauth['extra']['student']
    user.is_teacher = omniauth['extra']['teacher']
    user.is_management = omniauth['extra']['management']
    user.is_admin = omniauth['extra']['admin']
    user.token = omniauth['credentials']['token']
    user.save
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT 1  [["uid", 80]]
INSERT INTO "users" ("uid", "first_name", "last_name", "email", "is_student", "is_teacher", "is_management", "is_admin", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "uid"