app/views/activities/_form.html.erb

          <div class="col-lg-7">
            <%= f.select :course_id, Course.all.collect { |p| [p.title, p.id] }, {selected: @activity.course_id, include_blank: true}, class: 'form-control' %>
---
SELECT "courses".* FROM "courses"

          <div class="col-lg-7">
            <%= f.select :teacher_id, Teacher.order(:last_name).collect { |p| [p.last_name + ' ' + p.first_name, p.id] }, {selected: @activity.teacher_id, include_blank: true}, class: 'form-control' %>
---
SELECT "teachers".* FROM "teachers"  ORDER BY "teachers"."last_name" ASC

            <% if !@activity.persisted? %>
                <%= f.select :cohorts, Cohort.order(:name).collect { |p| [p.name, p.id] }, {selected: @activity.cohort_id, include_blank: true}, :multiple => true, :size => 5, class: 'form-control' %>
---
SELECT "cohorts".* FROM "cohorts"  ORDER BY "cohorts"."name" ASC