app/views/activities/_index.html.erb

                  <td>
                    <%= activity.teacher.last_name %> <%= activity.teacher.first_name %>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 14]]